[
  {
    "id": 0,
    "name": "CALME ET SPACIEUX APPART A L’HIVERNAGE MARRAKECH",
    "url": "https://www.booking.com/hotel/ma/calme-et-spacieux-appart-a-l-hivernage-marrakech.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located in Marrakech, 1.5 km from Djemaa El Fna and 1.6 km from Mouassine Museum, CALME ET SPACIEUX APPART A L’HIVERNAGE MARRAKECH provides air-conditioned accommodation with a balcony and free WiFi. This apartment also features a private pool. The property is non-smoking and is situated 1.2 km from Koutoubia Mosque.\n\nThe apartment is composed of 3 bedrooms, a fully equipped kitchen, and 3 bathrooms. Towels and bed linen are featured in the apartment.\n\nPopular points of interest near the apartment include Majorelle Gardens, Le Jardin Secret and Yves Saint Laurent Museum. The nearest airport is Marrakech-Menara Airport, 4 km from CALME ET SPACIEUX APPART A L’HIVERNAGE MARRAKECH.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 8,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "31.6295418",
      "lng": "-8.0007901"
    },
    "address": "Rue El Mahjoub Ermiza, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/459367734.jpg?k=87ea39b1f5e5a965fa78fca17ddfc07c9db91cc3c077a8bcd4c707df0d245ef4&o=&hp=1"
  },
  {
    "id": 1,
    "name": "Appartement dans triangle d’or",
    "url": "https://www.booking.com/hotel/ma/appartement-dans-triangle-d-or.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Appartement dans triangle d’or features a balcony and is set in Marrakech, within just 1.8 km of Mouassine Museum and 1.4 km of Koutoubia Mosque. The property is situated 2 km from Yves Saint Laurent Museum, 2.8 km from Bahia Palace and 3.4 km from The Orientalist Museum of Marrakech. Free WiFi is available throughout the property and Djemaa El Fna is 1.7 km away.\n\nLeading onto a terrace, this air-conditioned apartment comes with 2 separate bedrooms and a fully equipped kitchen. Towels and bed linen are featured in the apartment.\n\nPopular points of interest near the apartment include Majorelle Gardens, Le Jardin Secret and Marrakesh Train Station. The nearest airport is Marrakech-Menara Airport, 3 km from Appartement dans triangle d’or.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 10,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 12:00",
    "checkOut": "Until 14:00",
    "location": {
      "lat": "31.6284212",
      "lng": "-8.0034912"
    },
    "address": "Avenue Echouhada, Hivernage, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/469550584.jpg?k=2fb07d8a394afc13826bffaaf59fd56e54bfd4e22518c67add96dd32408a79ac&o=&hp=1"
  },
  {
    "id": 2,
    "name": "La Fontaine",
    "url": "https://www.booking.com/hotel/ma/la-fontaine.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at La Fontaine! To save at this property, all you have to do is sign in.\nFeaturing a spa bath, La Fontaine is located in Marrakech. Complimentary WiFi is provided throughout the property and private parking is available on site. The accommodation provides a 24-hour front desk and a lift for guests.\n\nThe spacious apartment with a balcony and garden views features 2 bedrooms, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 2 bathrooms with a bidet. The air-conditioned unit at the property features a bath and a dressing room. For added privacy, the accommodation has a private entrance and soundproofing.\n\nGuests at the apartment can enjoy hiking nearby, or make the most of the garden.\n\nPopular points of interest near La Fontaine include Djemaa El Fna, Majorelle Gardens and Mouassine Museum. The nearest airport is Marrakech-Menara Airport, 4 km from the accommodation.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 8.8,
    "reviews": 106,
    "breakfast": null,
    "checkIn": "From 15:00 to 00:00",
    "checkOut": "From 06:00 to 12:00",
    "location": {
      "lat": "31.6283334",
      "lng": "-8.0026103"
    },
    "address": "Boulevard Al Yarmouk 10, Hivernage, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/134156024.jpg?k=bf915842431c77000dda13e9602871bcbdd9a85e2e5abd0a648bef75c9c1c557&o=&hp=1"
  },
  {
    "id": 3,
    "name": "Palais d'hôtes Darsor",
    "url": "https://www.booking.com/hotel/ma/darsor-marrakech1.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "guest_house",
    "description": "You're eligible for a Genius discount at Palais d'hôtes Darsor! To save at this property, all you have to do is sign in.\nOffering a barbecue and terrace, Darsor is set in Marrakech in the Marrakech-Safi Region, 800 metres from Stadium.\n\nThe rooms come with a flat-screen TV with satellite channels. Some units have a seating area to relax in after a busy day. Enjoy a cup of coffee from your terrace or balcony. Rooms come with a private bathroom fitted with a bath or shower and bidet. For your comfort, you will find bathrobes and free toiletries. Darsor features free WiFi throughout the property.\n\nThere is a 24-hour front desk at the property.\n\nThe nearest airport is Marrakech-Menara Airport, 4 km from the property.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 8.7,
    "reviews": 615,
    "breakfast": null,
    "checkIn": "From 13:00",
    "checkOut": "Until 11:00",
    "location": {
      "lat": "31.6297960",
      "lng": "-8.0010778"
    },
    "address": "Rue El Mahjoub Ermiza, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/991/99145063.jpg"
  },
  {
    "id": 4,
    "name": "Hotel Le Grand Imilchil",
    "url": "https://www.booking.com/hotel/ma/le-grand-imilchil.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Hotel Le Grand Imilchil is located in Marrakech. Guests can enjoy the on-site restaurant. Private parking is available on site. Hotel Le Grand Imilchil features free WiFi throughout the property.\n\nEvery room has a flat-screen TV. Some rooms feature a seating area to relax in after a busy day. Certain units include views of the mountain or pool. The rooms are fitted with a private bathroom fitted with a bath.\n\nThere is a 24-hour front desk at the property. The hotel also offers car hire.\n\nPalais de La Bahia is 1.6 km from Hotel Le Grand Imilchil. Marrakech-Menara Airport is 4 km from the property.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 6.7,
    "reviews": 3032,
    "breakfast": null,
    "checkIn": "From 15:00 to 23:30",
    "checkOut": "From 04:00 to 12:00",
    "location": {
      "lat": "31.6276373",
      "lng": "-8.0035733"
    },
    "address": "Avenue Echouhada, Hivernage, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/850/85069048.jpg"
  },
  {
    "id": 5,
    "name": "Résidence andalouse rue tarik ibn ziad",
    "url": "https://www.booking.com/hotel/ma/residence-andalouse-rue-tarik-ibn-ziad.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Marrakech, 1.8 km from Majorelle Gardens and 1.8 km from Djemaa El Fna, Résidence andalouse rue tarik ibn ziad offers spacious air-conditioned accommodation with a balcony and free WiFi. The property is around 2.2 km from Marrakesh Train Station, 3 km from Bahia Palace and 3.2 km from The Orientalist Museum of Marrakech. The property is non-smoking and is located 1.9 km from Mouassine Museum.\n\nThe apartment is composed of 2 bedrooms, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is offered.\n\nPopular points of interest near the apartment include Le Jardin Secret, Koutoubia Mosque and Yves Saint Laurent Museum. The nearest airport is Marrakech-Menara Airport, 4 km from Résidence andalouse rue tarik ibn ziad.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 01:00 to 23:00",
    "checkOut": "From 00:00 to 11:00",
    "location": {
      "lat": "31.6308162",
      "lng": "-8.0016131"
    },
    "address": "Rue Ibn Atyar résidence Achraf, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/453822744.jpg?k=cc5b62b5747a3fd2bcb066a36f08a6a2f60229596d6755fb819299ab63e78906&o=&hp=1"
  },
  {
    "id": 6,
    "name": "Appartement",
    "url": "https://www.booking.com/hotel/ma/appartement-mrksh1.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Appartement is situated in Marrakech, 1.9 km from Mouassine Museum, 1.5 km from Koutoubia Mosque, and 1.8 km from Yves Saint Laurent Museum. The air-conditioned accommodation is 1.8 km from Majorelle Gardens, and guests can benefit from private parking available on site and free WiFi. The property is non-smoking and is located 1.8 km from Djemaa El Fna.\n\nThe spacious apartment features a balcony, 2 bedrooms, a living room and a well-equipped kitchen with a fridge and a minibar. A flat-screen TV is provided.\n\nMarrakesh Train Station is 2.2 km from the apartment, while Le Jardin Secret is 1.7 km away. The nearest airport is Marrakech-Menara Airport, 4 km from Appartement.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 01:00",
    "checkOut": "Available 24 hours",
    "location": {
      "lat": "31.6307482",
      "lng": "-8.0021851"
    },
    "address": "زنقة إبن عطية, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/454016709.jpg?k=f301dde857de454f0c69f1ee22b79a0495e87ee539badeb0c46678fce79eb6dd&o=&hp=1"
  },
  {
    "id": 7,
    "name": "Hotel Akabar",
    "url": "https://www.booking.com/hotel/ma/akabar.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hotel Akabar! To save at this property, all you have to do is sign in.\nThe Akabar sits in the residential area of L’Hivernage and is decorated in Moroccan style. It offers an outdoor pool surrounded by palm trees and air-conditioned rooms with balcony.\n\nThe famous Mohammed 5 Avenue, with its many shops, is just 500 metres away. There is also a kiosk in front of the Hotel Akabar selling tobacco, souvenirs and newspapers.\n\nAkabar’s restaurant serves international and Moroccan cuisine in the elegant dining room with chandeliers. You can also have a drink at the bar or have a snack at the pool-side fast-food.\n\nThe rooms are all equipped with a TV, a telephone and a safe. They each have a private bathroom with a bathtub.\n\nThe Akabar Hotel staff speaks English, French and Spanish and will be happy to help you organise your stay. Front desk is open 24 hours and free Wi-Fi access is provided in public areas.\n\nLocal activities include golf, horseback riding and tennis. Hotel Akabar is just 2 km from Jamaâ El Fna Square and 7 km from Menara Airport. Parking within the limit of availability.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 7.2,
    "reviews": 1229,
    "breakfast": null,
    "checkIn": "From 12:00 to 00:00",
    "checkOut": "From 01:00 to 12:30",
    "location": {
      "lat": "31.6267418",
      "lng": "-8.0031753"
    },
    "address": "Avenue Echouhada-Quartier De L'hivernage, Hivernage, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/276/276239226.jpg"
  },
  {
    "id": 8,
    "name": "Hôtel & Ryads Barrière Le Naoura",
    "url": "https://www.booking.com/hotel/ma/et-ryads-naoura-barriere-marrakech.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "The Naoura Barrière is spread over a beautiful garden landscape, centrally located in Marrakesh near the heart of the medina. It offers a peaceful setting and luxury facilities.\n\nThe suites at Naoura Barrière are spacious with modern amenities and en suite facilities. Special touches include bathrobes, DVD players and a balcony.\n\nThe hotel restaurants offer quality local cuisine using fresh market produce.The hotel bar offers a relaxing space to sample an original cocktail and wine list. An extensive buffet breakfast is served each morning.\n\nThe spa includes a full range of relaxing treatments, two traditional Moroccan Hammams, and fitness centre. There is a club for children including activities and meals. Tours can be organized upon request.\n\nThe Naoura Barrière is ideally located near the airport and walking distance to many key attractions.",
    "stars": 5,
    "price": null,
    "currency": "MAD",
    "rating": 8.8,
    "reviews": 400,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "31.6286008",
      "lng": "-7.9970169"
    },
    "address": "Djebel Alakhdar - Bab Doukkala, Medina, 40 000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/633/63331284.jpg"
  },
  {
    "id": 9,
    "name": "The Red House",
    "url": "https://www.booking.com/hotel/ma/the-red-house.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "guest_house",
    "description": "You're eligible for a Genius discount at The Red House! To save at this property, all you have to do is sign in.\nCentrally located in the heart of the Hivernage district, this luxurious palace offers comfortable rooms and a warm atmosphere. It includes free Wi-Fi and free parking.\n\nRooms at The Red House are spacious and come fully equipped with modern comforts including TV, en suite facilities and air conditioning. The entire hotel has been elegantly decorated with traditional architecture.\n\nThe friendly and attentive staff will make your stay as comfortable as possible. A peaceful garden and swimming pool are ideal places to relax in at the end of the day.\n\nBreakfast is served daily at The Red House and quality Moroccan cuisine is available in the hotel restaurant.  It is walking distance to the medina and local sites including Jamaâ El Fna Square.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 9.3,
    "reviews": 532,
    "breakfast": null,
    "checkIn": "From 14:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "31.6254194",
      "lng": "-8.0013406"
    },
    "address": "Av. El Yarmouk Hivernage, Hivernage, 40000 Marrakech, Morocco",
    "rooms": [],
    "region": "Marrakech-Safi",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/696/6960917.jpg"
  },
  {
    "id": 10,
    "name": "Appartement 70 M2 RES SAADA",
    "url": "https://www.booking.com/hotel/ma/appartement-70-m2-res-saada.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Appartement 70 M2 RES SAADA is situated in Agadir, 7 km from Medina Polizzi, 7 km from Agadir Oufella Ruins, as well as 8.4 km from La Medina d'Agadir. With free private parking, the property is 5.1 km from Amazighe Heritage Museum and 6.7 km from Marina Agadir. Royal Golf Agadir is 11 km away and Golf Tazegzout is 22 km from the apartment.\n\nThe spacious apartment has a balcony, 1 bedroom, a living room and a well-equipped kitchen. The property offers garden views.\n\nAgadir port is 9.3 km from the apartment, while Ocean Golf course is 10 km from the property. The nearest airport is Agadir–Al Massira Airport, 19 km from Appartement 70 M2 RES SAADA.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "30.4314841",
      "lng": "-9.5641502"
    },
    "address": "الحي المحمدي . السعادة 2 , الشطر 9 , الطابق الاول ، رقم الشقة 9, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/382544524.jpg?k=84b310f310dc6622d875af3b0648040e4fa5ace19c012a83ff7aca5f3b1c9001&o=&hp=1"
  },
  {
    "id": 11,
    "name": "Spacious 2BR Apt in Sunny Agadir",
    "url": "https://www.booking.com/hotel/ma/spacious-2br-apt-in-sunny-agadir.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Agadir in the Souss-Massa-Draa region, Spacious 2BR Apt in Sunny Agadir features a balcony and garden views. This property offers access to a terrace and free private parking. The property is non-smoking and is situated 5.1 km from Amazighe Heritage Museum.\n\nThe apartment is fitted with 1 bedroom, a flat-screen TV and a fully equipped kitchen that provides guests with an oven, a microwave, a washing machine, a fridge and a stovetop. Towels and bed linen are featured in the apartment. For added privacy, the accommodation features a private entrance.\n\nMarina Agadir is 6.7 km from the apartment, while Medina Polizzi is 7 km away. The nearest airport is Agadir–Al Massira Airport, 19 km from Spacious 2BR Apt in Sunny Agadir.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "From 11:00 to 12:00",
    "location": {
      "lat": "30.4313768",
      "lng": "-9.5641759"
    },
    "address": "Immeuble 118 appart 17 Résidence Saada 2  Hay mohammadi Agadir, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/499163288.jpg?k=a3f540b1769d32ed723fe9c7fb28be26c6aa85bae3dce12f9b199259fb0a0369&o=&hp=1"
  },
  {
    "id": 12,
    "name": "sous immo",
    "url": "https://www.booking.com/hotel/ma/sous-immo.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Featuring air-conditioned accommodation with a private pool, sous immo is located in Agadir. This property offers access to a balcony and free private parking. Agadir Oufella Ruins is 6.7 km away and Medina Polizzi is 7.4 km from the apartment.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is provided. The property offers garden views.\n\nAmazighe Heritage Museum is 5.2 km from the apartment, while Marina Agadir is 6.3 km away. The nearest airport is Agadir–Al Massira Airport, 20 km from sous immo.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "Available 24 hours",
    "checkOut": "Available 24 hours",
    "location": {
      "lat": "30.4287796",
      "lng": "-9.5649868"
    },
    "address": "8000 Agadir, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/375919685.jpg?k=f78ca5140f797960f3a023c43ea50d6e45a0a928f025918ce912ce240f5d159b&o=&hp=1"
  },
  {
    "id": 13,
    "name": "السعادة 2 الشطر 9 الحي المحمدي",
    "url": "https://www.booking.com/hotel/ma/ls-d-2-lshtr-9-lhy-lmhmdy.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Situated in Agadir, 7 km from Agadir Oufella Ruins and 7 km from Medina Polizzi, السعادة 2 الشطر 9 الحي المحمدي offers air conditioning. With free private parking, the property is 5.1 km from Amazighe Heritage Museum and 6.7 km from Marina Agadir. Ocean Golf course is 10 km from the apartment and Royal Golf Agadir is 11 km away.\n\nThe spacious apartment has a balcony, 1 bedroom, a living room and a well-equipped kitchen. A flat-screen TV is available. The property offers garden views.\n\nLa Medina d'Agadir is 8.5 km from the apartment, while Agadir port is 9.3 km from the property. The nearest airport is Agadir–Al Massira Airport, 19 km from السعادة 2 الشطر 9 الحي المحمدي.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "30.4316872",
      "lng": "-9.5642391"
    },
    "address": "Rue 2, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/383478964.jpg?k=9ab064502bea5f702a7c8f84f5c944f8aa749a5c9cb2bb674841164fd982e332&o=&hp=1"
  },
  {
    "id": 14,
    "name": "Appartement meublé avec piscine",
    "url": "https://www.booking.com/hotel/ma/appartement-meuble-avec-piscine-agadir.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Featuring a private pool and garden views, Appartement meublé avec piscine is located in Agadir. This property offers access to a balcony and free private parking. Marina Agadir is 6.8 km from the apartment and Agadir Oufella Ruins is 7.1 km away.\n\nThe spacious apartment features a terrace, 2 bedrooms, a living room and a well-equipped kitchen. A flat-screen TV is featured.\n\nAmazighe Heritage Museum is 4.4 km from the apartment, while Medina Polizzi is 6.4 km away. The nearest airport is Agadir–Al Massira Airport, 18 km from Appartement meublé avec piscine.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 00:00 to 13:00",
    "checkOut": "From 11:00 to 00:00",
    "location": {
      "lat": "30.4264364",
      "lng": "-9.5627165"
    },
    "address": "Rue Adrar, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/503227739.jpg?k=10e3da7c617e2cdd0303b733951bc1a11ae72bb8e0f8a536fd2e23d96e463a18&o=&hp=1"
  },
  {
    "id": 15,
    "name": "charmante appartement",
    "url": "https://www.booking.com/hotel/ma/charmante-appartement.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Charmante appartement is set in Agadir, 6.4 km from Medina Polizzi, 6.8 km from Marina Agadir, and 7.1 km from Agadir Oufella Ruins. This property offers access to a balcony and free private parking. The property is non-smoking and is situated 4.4 km from Amazighe Heritage Museum.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is available.\n\nLa Medina d'Agadir is 7.9 km from the apartment, while Ocean Golf course is 9.2 km from the property. The nearest airport is Agadir–Al Massira Airport, 18 km from charmante appartement.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 11:00",
    "location": {
      "lat": "30.4264364",
      "lng": "-9.5627165"
    },
    "address": "Rue Adrar, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/500962066.jpg?k=a49db98a518ad9f750d9e1a4e48483f35328b4109d2b56c721afa4b692dbf1a7&o=&hp=1"
  },
  {
    "id": 16,
    "name": "agadir",
    "url": "https://www.booking.com/hotel/ma/agadir-agadir22.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Agadir is situated in Agadir, 7.1 km from Agadir Oufella Ruins, 7.9 km from La Medina d'Agadir, as well as 9.2 km from Ocean Golf course. With free private parking, the property is 4.4 km from Amazighe Heritage Museum and 6.4 km from Medina Polizzi. The property is non-smoking and is set 6.8 km from Marina Agadir.\n\nThe apartment is composed of 2 bedrooms, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is featured.\n\nAgadir port is 9.4 km from the apartment, while Royal Golf Agadir is 11 km away. The nearest airport is Agadir–Al Massira Airport, 18 km from agadir.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": null,
    "checkOut": null,
    "location": {
      "lat": "30.4264364",
      "lng": "-9.5627165"
    },
    "address": "Rue Adrar, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/461312852.jpg?k=dc551855b69fb98162cf023200fcac2569cefae64c06e9b1bdd414ae0975962f&o=&hp=1"
  },
  {
    "id": 17,
    "name": "Mooie appartement ligt 8km van Het strand",
    "url": "https://www.booking.com/hotel/ma/mooie-appartement-ligt-8km-van-het-strand.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Mooie appartement ligt 8km van Het strand, a property with a garden, is set in Agadir, 6.4 km from Medina Polizzi, 6.8 km from Marina Agadir, as well as 7.1 km from Agadir Oufella Ruins. The property is around 7.9 km from La Medina d'Agadir, 9.2 km from Ocean Golf course and 9.4 km from Agadir port. The property is non-smoking and is located 4.4 km from Amazighe Heritage Museum.\n\nThe apartment features a terrace, 2 bedrooms, a living room and a well-equipped kitchen with a fridge and a stovetop. A flat-screen TV is provided. For added privacy, the accommodation features a private entrance.\n\nRoyal Golf Agadir is 11 km from the apartment, while Golf Tazegzout is 23 km away. The nearest airport is Agadir–Al Massira Airport, 18 km from Mooie appartement ligt 8km van Het strand.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 1,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 11:00",
    "location": {
      "lat": "30.4264364",
      "lng": "-9.5627165"
    },
    "address": "Rue Adrar, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/397721624.jpg?k=81786a4e6aa91550154e0e991d52e8bf223491dda33cebd74d6b0d554cd63408&o=&hp=1"
  },
  {
    "id": 18,
    "name": "Jnane adrar",
    "url": "https://www.booking.com/hotel/ma/jnane-adrar.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Agadir in the Souss-Massa-Draa region, Jnane adrar features a balcony. This property offers access to a terrace and free private parking. The property is non-smoking and is located 4.4 km from Amazighe Heritage Museum.\n\nThe spacious apartment is composed of 1 bedroom, a living room, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is provided.\n\nGuests can also relax in the garden.\n\nMedina Polizzi is 6.4 km from the apartment, while Marina Agadir is 6.8 km away. The nearest airport is Agadir–Al Massira Airport, 18 km from Jnane adrar.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 1,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 08:00 to 12:00",
    "checkOut": "From 10:00 to 12:00",
    "location": {
      "lat": "30.4264364",
      "lng": "-9.5627165"
    },
    "address": "Rue Adrar, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/479285103.jpg?k=f4075f8bff4b81c1b481597f8411059a044bc9211103611dc2aad9188e4dc282&o=&hp=1"
  },
  {
    "id": 19,
    "name": "Appartement ensoleillé et calme réservé aux familles couples mariés",
    "url": "https://www.booking.com/hotel/ma/appartement-ensoleille-et-calme.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Agadir, Appartement ensoleillé et calme réservé aux familles couples mariés offers accommodation with a private pool, a balcony and mountain views. The property features city views and is 6.5 km from Marina Agadir and 6.9 km from Agadir Oufella Ruins. Free WiFi is available throughout the property and Amazighe Heritage Museum is 5.4 km away.\n\nThe spacious apartment with a terrace and sea views has 2 bedrooms, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 2 bathrooms with a hot tub. Guests can take in the ambience of the surroundings from an outdoor dining area or keep themselves warm by the fireplace on colder days. The accommodation is non-smoking.\n\nMedina Polizzi is 7.4 km from the apartment, while La Medina d'Agadir is 8.9 km from the property. The nearest airport is Agadir–Al Massira Airport, 19 km from Appartement ensoleillé et calme réservé aux familles couples mariés.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 1,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 00:00",
    "location": {
      "lat": "30.4346534",
      "lng": "-9.5627123"
    },
    "address": "Hay mohammedi, 80000 Agadir, Morocco",
    "rooms": [],
    "region": "Souss-Massa-Draa",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/487763505.jpg?k=c3426fe229026710f0c5af63f9188fe2a9156fe66a5d24ee16cb49734fd94d20&o=&hp=1"
  },
  {
    "id": 20,
    "name": "Appartement a louer centre ville",
    "url": "https://www.booking.com/hotel/ma/appartement-a-louer-centre-ville.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located in Fès, 2.6 km from Royal Palace Fes and 1.8 km from Fes Railway Station, Appartement a louer centre ville offers air conditioning. The property is situated 3.8 km from Batha Square, 4.3 km from Bab Bou Jeloud Fes and 4.4 km from Medersa Bouanania. Staff on-site can arrange a shuttle service.\n\nThe apartment is equipped with 1 separate bedroom, 1 bathroom, a fully equipped kitchen with a dining area and fridge, and a living room with a flat-screen TV.\n\nKaraouiyne is 7.1 km from the apartment, while Aoua Lake is 49 km away. The nearest airport is Fès–Saïs, 14 km from Appartement a louer centre ville, and the property offers a paid airport shuttle service.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 8.1,
    "reviews": 37,
    "breakfast": null,
    "checkIn": "From 12:00 to 00:00",
    "checkOut": "From 11:00 to 12:00",
    "location": {
      "lat": "34.0347697",
      "lng": "-4.9981226"
    },
    "address": "7 Rue Rahal El Meskini, 30050 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/378684151.jpg?k=11c0e0f9dbc10b49435588d4578c7df8f12b7e26df4655a9c609edc2e8669bab&o=&hp=1"
  },
  {
    "id": 21,
    "name": "Bloemen Huis",
    "url": "https://www.booking.com/hotel/ma/victorine.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at Bloemen Huis! To save at this property, all you have to do is sign in.\nSituated in Fès, 2.6 km from Royal Palace Fes and 1.9 km from Fes Railway Station, Bloemen Huis offers a terrace and air conditioning. This property offers access to a balcony, free private parking and free WiFi. Batha Square is 3.7 km away and Bab Bou Jeloud Fes is 4.3 km from the apartment.\n\nThe spacious apartment features 2 bedrooms, a flat-screen TV with streaming services and a fully equipped kitchen that provides guests with an oven, a microwave, a washing machine, a toaster and a fridge. Towels and bed linen are available in the apartment. For added privacy, the accommodation features a private entrance.\n\nMedersa Bouanania is 4.4 km from the apartment, while Karaouiyne is 7.1 km from the property. The nearest airport is Fès–Saïs Airport, 14 km from Bloemen Huis.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 9.5,
    "reviews": 81,
    "breakfast": null,
    "checkIn": "From 09:00 to 18:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "34.0351741",
      "lng": "-4.9983832"
    },
    "address": "Rue Rahal El Meskini Apperment 15     4 etage gebouw Alhannasi, 30050 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/384598555.jpg?k=dd052ad8c685950bc2b37f50153092cdf7a9c971fc2fa4cd34154a702211a17f&o=&hp=1"
  },
  {
    "id": 22,
    "name": "Immeuble walili",
    "url": "https://www.booking.com/hotel/ma/immeuble-walili.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at Immeuble walili! To save at this property, all you have to do is sign in.\nBoasting air-conditioned accommodation with a balcony, Immeuble walili is situated in Fès. It is located 3.2 km from Royal Palace Fes and provides a lift. The apartment also features free WiFi, free private parking and facilities for disabled guests.\n\nThe spacious apartment features 3 bedrooms, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a fully equipped kitchen, and a terrace with city views. This apartment is allergy-free and non-smoking.\n\nA minimarket is available at the apartment.\n\nA baby safety gate is also available for guests at the apartment.\n\nFes Railway Station is 1.9 km from Immeuble walili, while Batha Square is 4.4 km from the property. The nearest airport is Fès–Saïs Airport, 12 km from the accommodation.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 8.9,
    "reviews": 14,
    "breakfast": null,
    "checkIn": "From 15:00 to 00:00",
    "checkOut": "From 10:00 to 12:00",
    "location": {
      "lat": "34.0349530",
      "lng": "-5.0008263"
    },
    "address": "Rue Abou Tayeb Al Moutanabi, Immeuble walili 5 appt 29, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/507325119.jpg?k=cf1b13f1b88075f821d68b5a6f1a6ec17813f94faeabc9c9071e92a7a92d4c08&o=&hp=1"
  },
  {
    "id": 23,
    "name": "الطابق الأول لفيلا مجهز بامتياز",
    "url": "https://www.booking.com/hotel/ma/ltbq-l-wl-lfyl-mjhz-bmtyz.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Fès in the Fes-Meknes region, with Fes Railway Station nearby, الطابق الأول لفيلا مجهز بامتياز offers accommodation with free WiFi and free private parking. The property is located 2.3 km from Royal Palace Fes, 3.5 km from Batha Square and 4 km from Bab Bou Jeloud Fes. Aoua Lake is 48 km from the apartment.\n\nWith direct access to a terrace, this air-conditioned apartment comes with 1 separate bedroom and a fully equipped kitchen. A flat-screen TV is offered.\n\nMedersa Bouanania is 4.1 km from the apartment, while Karaouiyne is 6.8 km from the property. The nearest airport is Fès–Saïs Airport, 13 km from الطابق الأول لفيلا مجهز بامتياز.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "34.0358369",
      "lng": "-4.9999493"
    },
    "address": "34.02148251135014, -5.029480957215092, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/514387729.jpg?k=a8f5bbb20908178c487bc080ac32e46498adee1c3cb312ee340bb8c6827303fc&o=&hp=1"
  },
  {
    "id": 24,
    "name": "Raha",
    "url": "https://www.booking.com/hotel/ma/raha-fs.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at Raha! To save at this property, all you have to do is sign in.\nSituated in Fès, 1.9 km from Fes Railway Station and 3.7 km from Batha Square, Raha offers air conditioning. Set 2.6 km from Royal Palace Fes, the property offers a garden and free private parking. Bab Bou Jeloud Fes is 4.3 km from the apartment and Medersa Bouanania is 4.3 km away.\n\nThe spacious apartment with a terrace and garden views features 1 bedroom, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 2 bathrooms with a bidet. A private entrance leads guests into the apartment, where they can enjoy some wine or champagne and fruits. This apartment is allergy-free and non-smoking.\n\nKaraouiyne is 7.1 km from the apartment, while Aoua Lake is 48 km away. The nearest airport is Fès–Saïs Airport, 12 km from Raha.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 7.6,
    "reviews": 52,
    "breakfast": null,
    "checkIn": "From 00:00 to 18:00",
    "checkOut": "From 08:00 to 00:00",
    "location": {
      "lat": "34.0336306",
      "lng": "-5.0020191"
    },
    "address": "230 حي الراحة, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/408366725.jpg?k=0502b465e1e956d9395fbcda96dac99c4d3c1de89281bd3c56815e51e37356f2&o=&hp=1"
  },
  {
    "id": 25,
    "name": "Hotel Mounia",
    "url": "https://www.booking.com/hotel/ma/ha-tel-mounia.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Located in the Ville Nouvelle district of the city, this air-conditioned hotel has a traditional Moroccan décor with Zellige and ancient engravings. It features a restaurant and a spa and a hammam.\n\nGuest rooms are simply decorated and offer a TV with satellite channels. They each have a modern en suite bathroom with a bathtub and guests can access free Wi-Fi throughtout the property.\n\nBreakfast is served each morning at the hotel. For other meals you can sample traditional Moroccan dishes at the Délice international restaurant, or enjoy a drink in the English-style bar.\n\nEvening entertainment is proposed in the hotel’s nightclub “Sphinx”. Relaxation activities include a body and hair treatments.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 6.2,
    "reviews": 107,
    "breakfast": null,
    "checkIn": "From 08:00 to 20:30",
    "checkOut": "From 08:30 to 20:00",
    "location": {
      "lat": "34.0348794",
      "lng": "-4.9963599"
    },
    "address": "60 Boulevard Zerktouny , 20000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/211/211011300.jpg"
  },
  {
    "id": 26,
    "name": "Appartement ensoleillé et lumineux à proximité du centre ville",
    "url": "https://www.booking.com/hotel/ma/appartement-ensoleille-et-lumineux-a-proximite-du-centre-ville.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located in Fès, Appartement ensoleillé et lumineux à proximité du centre ville is a sustainable accommodation, 2.3 km from Royal Palace Fes and 1.8 km from Fes Railway Station. Guests staying at this apartment have access to a balcony. The accommodation features airport transfers, while a car rental service is also available.\n\nWith free WiFi, this apartment provides a satellite flat-screen TV, a washing machine and a fully equipped kitchen with an oven and fridge. The air-conditioned unit at the property features a shower and a dressing room. The accommodation is non-smoking.\n\nGuests can eat in the on-site restaurant, which is open for dinner, lunch, brunch and high tea.\n\nGuests at the apartment will be able to enjoy activities in and around Fès, like walking tours.\n\nBatha Square is 3.5 km from Appartement ensoleillé et lumineux à proximité du centre ville, while Bab Bou Jeloud Fes is 4 km away. The nearest airport is Fès–Saïs Airport, 13 km from the accommodation.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 23:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "34.0359314",
      "lng": "-4.9999962"
    },
    "address": "Hay Badr, Résidence Mabrouka, immeuble D 6 A, appartement 37, 2 ème étage? Fès, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/509021878.jpg?k=dd13a862fbdd1a33b8a17f17941cb0029de04789b8cb7e51cdcf8ee9b403fde4&o=&hp=1"
  },
  {
    "id": 27,
    "name": "Center Medina",
    "url": "https://www.booking.com/hotel/ma/ghassane-khanafani-apartment.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at Center Medina! To save at this property, all you have to do is sign in.\nSet in Fès, 2.2 km from Royal Palace Fes and 1.6 km from Fes Railway Station, Center Medina offers air-conditioned accommodation with a patio and free WiFi. The property features garden and city views, and is 3.3 km from Batha Square. The accommodation features a lift, full-day security and currency exchange for guests.\n\nThe spacious apartment comes with 2 bedrooms, 2 bathrooms, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a balcony with mountain views. For added privacy, the accommodation has a private entrance and soundproofing.\n\nA minimarket is available at the apartment.\n\nA car rental service is available at the apartment.\n\nBab Bou Jeloud Fes is 3.9 km from Center Medina, while Medersa Bouanania is 3.9 km away. The nearest airport is Fès–Saïs, 13 km from the accommodation, and the property offers a paid airport shuttle service.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 8,
    "reviews": 144,
    "breakfast": null,
    "checkIn": "From 14:00 to 00:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "34.0367744",
      "lng": "-5.0001687"
    },
    "address": "Ghassane khanafani, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/319119123.jpg?k=ec26b1f8e9439c9331117d161fcd86d5a83dd6eac0a66dd9b67f167074965c5f&o=&hp=1"
  },
  {
    "id": 28,
    "name": "APPARTEMENTS NIA CONFORT, Plein centre ville, avec TERRASSE",
    "url": "https://www.booking.com/hotel/ma/appartement-plein-centre-ville-avec-terrasse.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "You're eligible for a Genius discount at APPARTEMENTS NIA CONFORT, Plein centre ville, avec TERRASSE! To save at this property, all you have to do is sign in.\nFeaturing air-conditioned accommodation with a balcony, APPARTEMENTS NIA CONFORT, Plein centre ville, avec TERRASSE is located in Fès. This property offers access to a terrace, free private parking and free WiFi. The accommodation provides a lift and full-day security for guests.\n\nThe spacious apartment features 3 bedrooms, a flat-screen TV, a fully equipped kitchen with a toaster and a fridge, a washing machine, and 2 bathrooms with an a bath or shower. Guests can enjoy a meal on an outdoor dining area while overlooking the garden views. The accommodation is non-smoking.\n\nRoyal Palace Fes is 2.1 km from the apartment, while Fes Railway Station is 1.6 km away. The nearest airport is Fès–Saïs Airport, 13 km from APPARTEMENTS NIA CONFORT, Plein centre ville, avec TERRASSE.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 9.8,
    "reviews": 28,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "34.0370850",
      "lng": "-4.9997260"
    },
    "address": "15 Ghassan kanafani Avenue, 30000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/455550992.jpg?k=05f5b2fdfad4bcf3d82cf5cfe0b5e58cc33984a4f97f59eb2b018cd6ef084e83&o=&hp=1"
  },
  {
    "id": 29,
    "name": "Hôtel Olympic",
    "url": "https://www.booking.com/hotel/ma/ha-tel-olympic.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "With a traditional architecture, this hotel is situated in Fes’ Medina and features air-conditioned room, a restaurant and a Moroccan-style lounge.  Fes Airport is 14 km away and the Train Station is a 14-minute walk.\n\nProvided with free Wi-Fi access, rooms at Hôtel Olympic have a private bathroom with a shower and a balcony with a panoramic view. Decorated with handicrafts, they are also provided with a satellite TV.\n\nA continental breakfast is offered daily and can be served in the room upon request. Guests are invited to sample the Moroccan dishes proposed by the hotel’s restaurant.\n\nFes Central Market is right next to the Hôtel Olympic and the Bou Inania Madrasa is a 10-minute drive. Fes Golf Club is an 11-minute drive and the thermal city of Moulay Yacoub is 22 km away.",
    "stars": 2,
    "price": null,
    "currency": "MAD",
    "rating": 8.4,
    "reviews": 5,
    "breakfast": null,
    "checkIn": "From 11:00 to 00:00",
    "checkOut": "From 07:00 to 12:00",
    "location": {
      "lat": "34.0397826",
      "lng": "-4.9984789"
    },
    "address": "Boulevard Mohamed V, 20000 Fès, Morocco",
    "rooms": [],
    "region": "Fes-Meknes",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/462/462802304.jpg"
  },
  {
    "id": 30,
    "name": "HOTEL DU LOUVRE",
    "url": "https://www.booking.com/hotel/ma/du-louvre-casablanca12.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Conveniently situated in Casablanca, HOTEL DU LOUVRE provides air-conditioned rooms with free private parking and room service. This 1-star hotel offers a 24-hour front desk and a concierge service. Hassan II Mosq is 3.9 km from the hotel and Anfa Place Living Resort is 4.9 km away.\n\nAt the hotel, each room comes with a balcony. Guest rooms in HOTEL DU LOUVRE are equipped with a flat-screen TV and free toiletries.\n\nPopular points of interest near the accommodation include Central Market of Casablanca, Arab League Park and Casablanca Cathedral. The nearest airport is Mohammed V International, 28 km from HOTEL DU LOUVRE, and the property offers a paid airport shuttle service.",
    "stars": 1,
    "price": null,
    "currency": "MAD",
    "rating": 5.4,
    "reviews": 560,
    "breakfast": null,
    "checkIn": "Available 24 hours",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "33.5941860",
      "lng": "-7.6162110"
    },
    "address": "36 Rue Nationale BD DRISS LAHRIZI CASABLANCA, Sidi Belyout, 20000 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/351/351292928.jpg"
  },
  {
    "id": 31,
    "name": "Hotel de paris",
    "url": "https://www.booking.com/hotel/ma/de-paris-casablanca.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hotel de paris! To save at this property, all you have to do is sign in.\nSet in Casablanca, 6 km from Hassan II Mosq, Hotel de paris features a shared lounge and views of the city. This 3-star hotel offers a concierge service. The accommodation offers a 24-hour front desk, room service and luggage storage for guests.\n\nAt the hotel, all rooms are fitted with a wardrobe. Complete with a private bathroom fitted with a shower and free toiletries, all guest rooms at Hotel de paris have a flat-screen TV and air conditioning, and some rooms also offer a terrace.\n\n\nGuests at the accommodation can enjoy a continental or a à la carte breakfast.\n\nAnfa Place Living Resort is 8 km from Hotel de paris, while Morocco Mall is 11 km from the property. The nearest airport is Mohammed V International, 22 km from the hotel, and the property offers a paid airport shuttle service.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 8.4,
    "reviews": 1843,
    "breakfast": null,
    "checkIn": "From 12:00 to 22:00",
    "checkOut": "Until 12:30",
    "location": {
      "lat": "33.5923492",
      "lng": "-7.6160589"
    },
    "address": "2 rue cherif Ameziane ex Branly Prine mly Abdellah centre ville, Sidi Belyout, 20100 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/344/344327200.jpg"
  },
  {
    "id": 32,
    "name": "Hotel Majestic",
    "url": "https://www.booking.com/hotel/ma/majestic-casablanca3.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hotel Majestic! To save at this property, all you have to do is sign in.\nSet in Casablanca, 2.6 km from Hassan II Mosq, Hotel Majestic features free WiFi access and free private parking.\n\nEvery room is fitted with a flat-screen TV with cable channels. Certain units have a seating area to relax in after a busy day. Each room has a private bathroom.\n\nThere is a 24-hour front desk at the property. Guests can enjoy the on-site restaurant.\n\nAnfa Place Living Resort is 5 km from Hotel Majestic, while Ain Diab Corniche is 6 km from the property. The nearest airport is Mohammed V International Airport, 24 km from Hotel Majestic.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 7.1,
    "reviews": 7455,
    "breakfast": null,
    "checkIn": "From 14:00 to 18:00",
    "checkOut": "From 12:00 to 13:00",
    "location": {
      "lat": "33.5911606",
      "lng": "-7.6134307"
    },
    "address": "57, Avenue Lalla Yacout Casablanca Maroc, Sidi Belyout, 20000 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/309/309640500.jpg"
  },
  {
    "id": 33,
    "name": "Hôtel Transatlantique",
    "url": "https://www.booking.com/hotel/ma/ha-tel-transatlantique.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "A 17-minute walk from Bab Marrakesh souks, this hotel proposes a piano bar, 2 restaurants and an Oriental cabaret. It offers air-conditioned accommodation with free Wi-Fi a 14-minute walk from Casa Port Train Station.\n\nEach room has an en suite bathroom with bathtub and bathrobe. All include a TV with satellite channels and some have a balcony. All feature elements of traditional Moroccan decoration.\n\nA buffet breakfast is provided in the morning. For other meals you can choose between 2 restaurants offering international and Moroccan specialties.\n\nHôtel Transatlantique is located 3 km from Casa Voyageur Train Station and 35 km from Mohamed V Airport. Casablanca Morocco Mall is a 20-minute drive away.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 6.1,
    "reviews": 232,
    "breakfast": null,
    "checkIn": "From 12:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "33.5918595",
      "lng": "-7.6145500"
    },
    "address": "79, Rue Chaouia (ex Colbert), Sidi Belyout, 20000 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/334/334020426.jpg"
  },
  {
    "id": 34,
    "name": "Hôtel Astrid",
    "url": "https://www.booking.com/hotel/ma/ha-tel-astrid.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hôtel Astrid! To save at this property, all you have to do is sign in.\nHôtel Astrid is located in Casablanca, 2 km from the train station and 7 km from the port. The hotel is traditionally decorated and offers free Wi-Fi internet access in public areas.\n\nThe guest rooms at Hôtel Astrid include a TV, a telephone and a seating area. Each room also has a private bathroom with a bathtub.\n\nMoroccan dishes can be enjoyed in the on-site restaurant and a continental breakfast is prepared every morning. Luggage storage is available and the hotel features a 24-hour reception.\n\nHassan II Mosque is 10 km away and Mohammed V International Airport is reached by car in 25 minutes. There is a shopping centre located just 3 km from the property.",
    "stars": 2,
    "price": null,
    "currency": "MAD",
    "rating": 7.6,
    "reviews": 955,
    "breakfast": null,
    "checkIn": "From 11:00 to 00:00",
    "checkOut": "From 12:00 to 12:30",
    "location": {
      "lat": "33.5907557",
      "lng": "-7.6162344"
    },
    "address": "12, rue 6 novembre, Sidi Belyout, 20130 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/916/91634606.jpg"
  },
  {
    "id": 35,
    "name": "Appartement Néoclassique centre-ville",
    "url": "https://www.booking.com/hotel/ma/appartement-11-janvier-centre-ville.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Appartement Néoclassique centre-ville provides accommodation located 700 metres from the centre of Casablanca and offers a terrace and a shared lounge. Among the facilities at this property are a lift and a shared kitchen, along with free WiFi throughout the property. The property is non-smoking and is set 4.1 km from Hassan II Mosq.\n\nThe spacious apartment comes with 3 bedrooms, 2 bathrooms, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a balcony with city views.\n\nYou can play billiards and table tennis at the apartment. A bowling alley is also available for guests at Appartement Néoclassique centre-ville.\n\nPopular points of interest near the accommodation include Central Market of Casablanca, Arab League Park and Casablanca Cathedral. The nearest airport is Mohammed V International Airport, 28 km from Appartement Néoclassique centre-ville.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 9.6,
    "reviews": 5,
    "breakfast": null,
    "checkIn": "From 00:30 to 23:30",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "33.5916483",
      "lng": "-7.6157522"
    },
    "address": "10 Boulevard du 11janvier 2, Sidi Belyout, 20250 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/503366421.jpg?k=e72b3cc785e78b0cd6444925a9f3bfd4c901c77aaceefacad94bfcb049d18adc&o=&hp=1"
  },
  {
    "id": 36,
    "name": "Hôtel Amouday",
    "url": "https://www.booking.com/hotel/ma/amoud.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hôtel Amouday! To save at this property, all you have to do is sign in.\nHotel Amoud is located in the heart of Casablanca, near the medina and the Place Mohamed V. It offers air-conditioned rooms with a private bathroom, free Wi-Fi access and satellite TV.\n\nThe Amoud has a 24-hour reception and offers a laundry and valet service.\n\nPrivate parking is available at Hotel Amoud, as well as an airport transfer service.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 7.3,
    "reviews": 666,
    "breakfast": null,
    "checkIn": "From 12:00 to 22:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "33.5926683",
      "lng": "-7.6148437"
    },
    "address": "51,Rue Taher Sebti, Sidi Belyout, 20000 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/268/268502467.jpg"
  },
  {
    "id": 37,
    "name": "Dar mektoube",
    "url": "https://www.booking.com/hotel/ma/dar-mektoube.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Situated in Casablanca, 5 km from Anfa Place Living Resort and 10 km from Morocco Mall, Dar mektoube offers air conditioning. The property is around 1.1 km from Casa Port Railway Terminal, 1.5 km from Ancient Medina of Casablanca and 3.7 km from Casa Voyageurs Train Station. The property is 700 metres from the city centre and 3.9 km from Hassan II Mosq.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is available. The accommodation is non-smoking.\n\nPopular points of interest near the apartment include Central Market of Casablanca, Arab League Park and Casablanca Cathedral. The nearest airport is Mohammed V International Airport, 28 km from Dar mektoube.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "33.5944697",
      "lng": "-7.6181468"
    },
    "address": "Boulevard Hassan II 13, Sidi Belyout, 20250 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/488401341.jpg?k=21254ab924a634af957494a6e75be96c1c9cf0e95506341d419fdec3124b9f72&o=&hp=1"
  },
  {
    "id": 38,
    "name": "One Hotel Casablanca",
    "url": "https://www.booking.com/hotel/ma/one-casablanca.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at One Hotel Casablanca! To save at this property, all you have to do is sign in.\nGet the celebrity treatment with world-class service at One Hotel CasablancaSituated in Casablanca and with Hassan II Mosq reachable within 4.1 km, One Hotel Casablanca features concierge services, non-smoking rooms, a garden, free WiFi throughout the property and a terrace. This 5-star hotel offers an ATM. The accommodation offers room service, a 24-hour front desk and currency exchange for guests.\n\nThe hotel will provide guests with air-conditioned rooms offering a desk, a coffee machine, a fridge, a minibar, a safety deposit box, a flat-screen TV and a private bathroom with a bidet. At One Hotel Casablanca rooms have bed linen and towels.\n\nA buffet breakfast is available each morning at the accommodation.\n\nPopular points of interest near One Hotel Casablanca include Central Market of Casablanca, Arab League Park and Casablanca Cathedral. The nearest airport is Mohammed V International, 28 km from the hotel, and the property offers a paid airport shuttle service.",
    "stars": 5,
    "price": null,
    "currency": "MAD",
    "rating": 7.9,
    "reviews": 1250,
    "breakfast": "Buffet",
    "checkIn": "From 13:00 to 23:30",
    "checkOut": "From 10:00 to 12:00",
    "location": {
      "lat": "33.5913450",
      "lng": "-7.6155640"
    },
    "address": "24 Blvd 11janvier, Sidi Belyout, 20000 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/514/514773238.jpg"
  },
  {
    "id": 39,
    "name": "Ennesma Hotel",
    "url": "https://www.booking.com/hotel/ma/ennesma.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Situated in the Sidi Belyout district in Casablanca, Ennesma Hotel offers 4-star rooms with free WiFi. The property is around 6 km from Anfa Place Living Resort, 11 km from Morocco Mall and 1.6 km from Casa Port Railway Terminal. The property is 700 metres from the city centre and 4.6 km from Hassan II Mosq.\n\nSpeaking Arabic, English and French, staff will be happy to provide guests with practical advice on the area at the reception.\n\nPopular points of interest near the hotel include Arab League Park, Central Market of Casablanca and Casablanca Cathedral. The nearest airport is Mohammed V International, 28 km from Ennesma Hotel, and the property offers a paid airport shuttle service.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 7.8,
    "reviews": 187,
    "breakfast": null,
    "checkIn": "From 14:00 to 20:00",
    "checkOut": "From 07:00 to 12:00",
    "location": {
      "lat": "33.5886381",
      "lng": "-7.6153367"
    },
    "address": "71 Rue El Wahda, Sidi Belyout, 20250 Casablanca, Morocco",
    "rooms": [],
    "region": "Casablanca-Settat",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/498/498086173.jpg"
  },
  {
    "id": 40,
    "name": "Maison vue mer Al Hoceïma",
    "url": "https://www.booking.com/hotel/ma/maison-vue-mer-al-hoceima.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "holiday_home",
    "description": "Boasting garden views, Maison vue mer Al Hoceïma is situated in Al Hoceima, around 2.2 km from Plage Izdhi. This property offers access to a balcony and free private parking. The property is non-smoking and is set 700 metres from Quemado Beach.\n\nThe spacious holiday home has a terrace, 4 bedrooms, a living room and a well-equipped kitchen. A flat-screen TV is offered.\n\nThe nearest airport is Cherif Al Idrissi Airport, 15 km from the holiday home.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "35.2445589",
      "lng": "-3.9317468"
    },
    "address": "Igrazgar, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/489337384.jpg?k=f13d1a4feedfbbd3869fd96155c3423d0d9236280619bc3fb636247d67ff04a0&o=&hp=1"
  },
  {
    "id": 41,
    "name": "Diyar albahr",
    "url": "https://www.booking.com/hotel/ma/diyar-albahr-al-hoceima2.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Al Hoceima, Diyar albahr features accommodation 2.2 km from Plage Izdhi. The property is non-smoking and is situated 700 metres from Quemado Beach.\n\nWith 2 bedrooms, this apartment has a balcony, a living room and a flat-screen TV.\n\nThe nearest airport is Cherif Al Idrissi Airport, 15 km from the apartment.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 1,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "35.2445589",
      "lng": "-3.9317468"
    },
    "address": "Calabonita, 12000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/472309290.jpg?k=4b47774679f4a979ae1b6f81c871fd96a0bdd259ac4d30ec161b1523597a01d7&o=&hp=1"
  },
  {
    "id": 42,
    "name": "Hay manzah Apprt",
    "url": "https://www.booking.com/hotel/ma/hay-manzah.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Offering quiet street views, Hay manzah Apprt is an accommodation situated in Al Hoceima, 1.2 km from Quemado Beach and 2.1 km from Plage Izdhi. The apartment has family rooms.\n\nAt the apartment complex each unit comes with private entrance, wardrobe, a TV and a private bathroom. All units will provide guests with a fridge.\n\nThe nearest airport is Cherif Al Idrissi Airport, 16 km from the apartment.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 7,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 14:00 to 22:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "35.2454779",
      "lng": "-3.9355746"
    },
    "address": "Rue Ab Torres, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/476/476489751.jpg"
  },
  {
    "id": 43,
    "name": "Hôtel La Perla",
    "url": "https://www.booking.com/hotel/ma/la-perla.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hôtel La Perla! To save at this property, all you have to do is sign in.\nHotel La Perla, located in a strategic location in the center of the town of Al-Hoceima, near the Quemado Beach, Our Hotel has 100 rooms, some of which are superior rooms have a balcony. Are all equipped with air conditioning, wifi, flat screen TV, hairdryer, safe, and minibar available.\nOur Hotel also has a restaurant located on the 7th floor offering a superb panoramic sea view.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 7.5,
    "reviews": 616,
    "breakfast": null,
    "checkIn": "From 13:30 to 21:00",
    "checkOut": "From 06:00 to 12:00",
    "location": {
      "lat": "35.2469400",
      "lng": "-3.9313030"
    },
    "address": "Av Tarik Ibnou Zaiad, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/372/372831060.jpg"
  },
  {
    "id": 44,
    "name": "Appartement centre ville",
    "url": "https://www.booking.com/hotel/ma/appartement-centre-ville-al-hoceima.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set in Al Hoceima, 1.5 km from Quemado Beach and 2.2 km from Plage Izdhi, Appartement centre ville provides accommodation with amenities such as free WiFi and a flat-screen TV. Guests staying at this apartment have access to a balcony.\n\nThe apartment is composed of 2 bedrooms, a fully equipped kitchen, and 1 bathroom. The accommodation is non-smoking.\n\nThe nearest airport is Cherif Al Idrissi Airport, 16 km from the apartment.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 6.8,
    "reviews": 5,
    "breakfast": null,
    "checkIn": "From 14:00 to 22:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "35.2441213",
      "lng": "-3.9363289"
    },
    "address": "Rue Khalid Ibn Al Walid, 21000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/373072810.jpg?k=705c351795c5e896b70d2d88a66c226b4b4fefdabeb30d408a1f6907ddb17481&o=&hp=1"
  },
  {
    "id": 45,
    "name": "Centre ville appartement",
    "url": "https://www.booking.com/hotel/ma/centre-ville-appartement-al-hoceima1.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Featuring city views, Centre ville appartement provides accommodation with a private beach area and a balcony, around 700 metres from Quemado Beach. This beachfront property offers access to a terrace, free private parking and free WiFi. The property is non-smoking and is located 2.4 km from Plage Izdhi.\n\nThe apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is featured.\n\nThe nearest airport is Cherif Al Idrissi Airport, 15 km from the apartment.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 12:00 to 00:00",
    "checkOut": "From 12:00 to 13:00",
    "location": {
      "lat": "35.2447579",
      "lng": "-3.9311675"
    },
    "address": "شارع حجرة النكور, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/473647692.jpg?k=5fdbbfa824d1351d17d301af80a365a35fad9f38c7aec561899318cfbb0a8a18&o=&hp=1"
  },
  {
    "id": 46,
    "name": "El maazouzi",
    "url": "https://www.booking.com/hotel/ma/el-maazouzi.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "homestay",
    "description": "El maazouzi offers accommodation in Al Hoceima, 2 km from Plage Izdhi. The property is non-smoking and is located less than 1 km from Quemado Beach.\n\nThe nearest airport is Cherif Al Idrissi Airport, 16 km from the homestay.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 10:00 to 18:00",
    "checkOut": "From 11:00 to 22:00",
    "location": {
      "lat": "35.2476577",
      "lng": "-3.9314504"
    },
    "address": "Rue al joundi al maghribi  al hoceima Rez de chaussée, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/487339815.jpg?k=895c9e52512f690edcc1975ffdabaae395103e008bb9a02e3fcfa8f7bacdaf84&o=&hp=1"
  },
  {
    "id": 47,
    "name": "Joli appartement meublé à louer à Al-Hoceima",
    "url": "https://www.booking.com/hotel/ma/joli-appartement-meuble-a-louer-a-al-hoceima.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Situated in Al Hoceima, Joli appartement meublé à louer à Al-Hoceima is a sustainable accommodation, less than 1 km from Quemado Beach and 2.4 km from Plage Izdhi. Guests staying at this apartment have access to a balcony. Guests can make use of a terrace.\n\nThe spacious apartment is composed of 2 bedrooms, a living room, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is offered. The accommodation is non-smoking.\n\nThe nearest airport is Cherif Al Idrissi Airport, 15 km from the apartment.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 8.2,
    "reviews": 5,
    "breakfast": null,
    "checkIn": "From 12:00 to 18:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "35.2432741",
      "lng": "-3.9312266"
    },
    "address": "Rue Andalous, 32000 Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/320072129.jpg?k=57eed291777628748241e7806160ddaac7b2ede11635f97c2eaa620afd16cd14&o=&hp=1"
  },
  {
    "id": 48,
    "name": "Rafi Apartments al Hoceima",
    "url": "https://www.booking.com/hotel/ma/al-hoceima-mzwrn.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Set 800 metres from Quemado Beach and 2.2 km from Plage Izdhi, Rafi Apartments al Hoceima offers accommodation in Al Hoceima.\n\nThe apartment is composed of 2 bedrooms, a fully equipped kitchen, and 1 bathroom. A flat-screen TV is offered.\n\nThe nearest airport is Cherif Al Idrissi Airport, 16 km from the apartment.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 13:00 to 23:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "35.2471818",
      "lng": "-3.9295946"
    },
    "address": "شارع ليبيا, Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/481620942.jpg?k=d3b8d293364800cb89558b3f045371e6b26b6bbf7506ba02c5ae9c131eee6bf2&o=&hp=1"
  },
  {
    "id": 49,
    "name": "appartement in al hoceima",
    "url": "https://www.booking.com/hotel/ma/appartement-in-al-hoceima.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Boasting garden views, appartement in al hoceima features accommodation with a garden and a balcony, around 1 km from Quemado Beach. This beachfront property offers access to a terrace and free private parking. The property is non-smoking and is situated 2.3 km from Plage Izdhi.\n\nThe spacious apartment includes 2 bedrooms and a fully equipped kitchen with a fridge and a coffee machine. A flat-screen TV is available.\n\nA car rental service is available at the apartment.\n\nThe nearest airport is Cherif Al Idrissi Airport, 15 km from appartement in al hoceima.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 6.1,
    "reviews": 8,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "35.2433386",
      "lng": "-3.9314631"
    },
    "address": "Place Al Madina, Al Hoceima, Morocco",
    "rooms": [],
    "region": "Tanger-Tetouan",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/476598091.jpg?k=1be8cfcd0e9126948d3ecbeae592abf7236e29f4c4df4d2ec30bbadfa4661830&o=&hp=1"
  },
  {
    "id": 50,
    "name": "Appartement Annakhil",
    "url": "https://www.booking.com/hotel/ma/appartement-annakhil-rabat.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located 2.6 km from Plage de Rabat and 1.2 km from The National Library of the Kingdom of Morocco in Rabat, Appartement Annakhil offers accommodation with a kitchen. Featuring a garden, the apartment is close to several noted attractions, around 2 km from Hassan Tower, 300 metres from National Office for Hydrocarbons and Mining and 500 metres from Moroccan Parliament. Free WiFi is available throughout the property and Plage de Salé Ville is 2.6 km away.\n\nOpening onto a terrace with garden views, the spacious air-conditioned apartment consists of 1 bedroom. A flat-screen TV is provided. The accommodation is non-smoking.\n\nKasbah of the Udayas is 2.8 km from the apartment, while Bouregreg Marina is 3.9 km away. The nearest airport is Rabat-Salé Airport, 10 km from Appartement Annakhil.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 11:00",
    "location": {
      "lat": "34.0145290",
      "lng": "-6.8333856"
    },
    "address": "Avenue Moulay Hassan, Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/480015638.jpg?k=364d83738240c8d39dbdf4174ffbaa39725baa10ec23f2d0bc5b3ca669fde185&o=&hp=1"
  },
  {
    "id": 51,
    "name": "Superbe appartement au centre de la capitale",
    "url": "https://www.booking.com/hotel/ma/superbe-appartement-au-centre-de-la-capitale.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located in Rabat, 2.5 km from Plage de Salé Ville and 2.5 km from Plage de Rabat, Superbe appartement au centre de la capitale offers air conditioning. This property offers access to a balcony and free private parking. The property is non-smoking and is situated 1.5 km from The National Library of the Kingdom of Morocco.\n\nThe spacious apartment features a terrace, 1 bedroom, a living room and a well-equipped kitchen with a fridge. Towels and bed linen are featured in the apartment.\n\nThere is a coffee shop on-site.\n\nGuests at the apartment will be able to enjoy activities in and around Rabat, like walking tours.\n\nPopular points of interest near Superbe appartement au centre de la capitale include Hassan Tower, National Office for Hydrocarbons and Mining and Moroccan Parliament. The nearest airport is Rabat-Salé Airport, 10 km from the accommodation.",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": 6.9,
    "reviews": 8,
    "breakfast": null,
    "checkIn": "From 14:00 to 20:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "34.0154333",
      "lng": "-6.8322584"
    },
    "address": "6 Rue Ben Ghazi, Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/386367562.jpg?k=6aa499773fc3cc6dcd2621c5994420834cf40e5a4d4e79df0e178cdf9bfa0b92&o=&hp=1"
  },
  {
    "id": 52,
    "name": "Helnan Chellah Hotel",
    "url": "https://www.booking.com/hotel/ma/helnan-chellah.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Helnan Chellah Hotel is located in the centre of Rabat close to the attractions and shopping centres. Please note that access to our sauna is subject to a fee and is not free.\n\nThe Helnan Chellah has spacious rooms decorated with elegant furniture, and they include a minibar, air conditioning and a TV. The bathrooms are fitted with a bath and shower.\nA buffet breakfast is prepared every morning at this hotel. Traditional meals are served in the restaurant, and you can enjoy refreshing drinks from the bar.\n\nThe airport is 12 km away and the nearest train station is Gare Rabat Ville, which is 1 km away. The Archaeology Museum is in front of the hotel, and the Royal Golf Dar Es Salam is 10 km away.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 7.5,
    "reviews": 369,
    "breakfast": null,
    "checkIn": "From 14:00 to 18:00",
    "checkOut": "From 10:00 to 12:00",
    "location": {
      "lat": "34.0146589",
      "lng": "-6.8320598"
    },
    "address": "2 Rue D Ifni, Quartier Administratif, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/119/11966832.jpg"
  },
  {
    "id": 53,
    "name": "Appartement au centre de Rabat à Hassan.",
    "url": "https://www.booking.com/hotel/ma/appartement-au-centre-de-rabat-a-hassan.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Boasting quiet street views, Appartement au centre de Rabat à Hassan. Features accommodation with a balcony, around 2.7 km from Plage de Salé Ville. The property is set 2.6 km from Hassan Tower, 3 km from Kasbah of the Udayas and 4.6 km from Bouregreg Marina. The property is non-smoking and is situated 2.8 km from Plage de Rabat.\n\nThis air-conditioned apartment features 1 bedroom, a satellite flat-screen TV, a dining area, and a fully equipped kitchen with a fridge and kitchenware. This apartment also includes a terrace that doubles up as an outdoor dining area.\n\nPopular points of interest near the apartment include The National Library of the Kingdom of Morocco, Moroccan Parliament and National Office for Hydrocarbons and Mining. The nearest airport is Rabat-Salé Airport, 10 km from Appartement au centre de Rabat à Hassan..",
    "stars": null,
    "price": null,
    "currency": "MAD",
    "rating": null,
    "reviews": 0,
    "breakfast": null,
    "checkIn": "From 15:00",
    "checkOut": "Until 11:00",
    "location": {
      "lat": "34.0144895",
      "lng": "-6.8353966"
    },
    "address": "Rue al khalil, Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/508244279.jpg?k=9720e3b832238325e571841cabf2c908b7b8a448d1a73c25bb38496800c9c022&o=&hp=1"
  },
  {
    "id": 54,
    "name": "Terrasse Panoramique de Rabat",
    "url": "https://www.booking.com/hotel/ma/rabat-rabat6.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Situated in Rabat, 2.5 km from Plage de Rabat and 2.6 km from Plage de Salé Ville, Terrasse Panoramique de Rabat features air-conditioned accommodation with a balcony and free WiFi. The property is close to several well-known attractions, 500 metres from National Office for Hydrocarbons and Mining, 1 km from Ministry of Agriculture and Marine Fisheries and 1.2 km from Ministry of industry, trade, investment and the Digital Economy. Kasbah of the Udayas is 2.7 km from the apartment and Bouregreg Marina is 4.2 km away.\n\nThe spacious apartment with a terrace and city views has 2 bedrooms, a living room, a flat-screen TV, an equipped kitchen with an oven and a microwave, and 1 bathroom with a shower. For added privacy, the accommodation features a private entrance.\n\nPopular points of interest near the apartment include The National Library of the Kingdom of Morocco, Hassan Tower and Moroccan Parliament. The nearest airport is Rabat-Salé Airport, 10 km from Terrasse Panoramique de Rabat.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 10,
    "reviews": 1,
    "breakfast": null,
    "checkIn": "From 15:00 to 18:00",
    "checkOut": "From 08:00 to 12:00",
    "location": {
      "lat": "34.0156876",
      "lng": "-6.8344362"
    },
    "address": "465 Avenue Mohammed V, Hassan, Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/509022397.jpg?k=5babda50f6767399b52c14da966d6ffea729be5c80d7270db52922842d068e9c&o=&hp=1"
  },
  {
    "id": 55,
    "name": "Panoramic view of downtown Rabat",
    "url": "https://www.booking.com/hotel/ma/panoramic-view-of-downtown-rabat.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Located in Rabat, 2.5 km from Plage de Salé Ville and 2.6 km from Plage de Rabat, Panoramic view of downtown Rabat provides air-conditioned accommodation with a balcony and free WiFi. It is set 1.3 km from The National Library of the Kingdom of Morocco and offers a lift. Kasbah of the Udayas is 2.7 km from the apartment and Bouregreg Marina is 4.2 km away.\n\nThe spacious apartment comes with 2 bedrooms, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a terrace with city views. The unit at the property features a hot tub and a dressing room. The property has an outdoor dining area.\n\nGuests at the apartment can enjoy walking tours nearby, or make the most of the garden.\n\nPopular points of interest near Panoramic view of downtown Rabat include Hassan Tower, Moroccan Parliament and National Office for Hydrocarbons and Mining. The nearest airport is Rabat-Salé Airport, 10 km from the accommodation.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 10,
    "reviews": 2,
    "breakfast": null,
    "checkIn": "From 14:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "34.0156781",
      "lng": "-6.8344229"
    },
    "address": "469 Avenue Mohammed V, Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/502755253.jpg?k=444f93c52c130b13d0a2a84e1c0208d0b5cafae5590d6bc9c3f7c10c66b8eac0&o=&hp=1"
  },
  {
    "id": 56,
    "name": "Le nid du centre ville",
    "url": "https://www.booking.com/hotel/ma/le-nid-du-centre-ville.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "apartment",
    "description": "Boasting city views, Le nid du centre ville provides accommodation with a balcony, around 2.5 km from Plage de Rabat. This property is situated a short distance from attractions such as National Office for Hydrocarbons and Mining, Ministry of Agriculture and Marine Fisheries, and Ministry of industry, trade, investment and the Digital Economy. The accommodation features a lift, and currency exchange for guests.\n\nThe spacious apartment features 2 bedrooms, 1 bathroom, bed linen, towels, a flat-screen TV with satellite channels, a dining area, a fully equipped kitchen, and a terrace with lake views. The air-conditioned unit at the property features a walk-in shower and a dressing room. The property has an outdoor dining area.\n\nPopular points of interest near the apartment include The National Library of the Kingdom of Morocco, Hassan Tower and Moroccan Parliament. The nearest airport is Rabat-Salé Airport, 10 km from Le nid du centre ville.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 9.3,
    "reviews": 55,
    "breakfast": null,
    "checkIn": null,
    "checkOut": null,
    "location": {
      "lat": "34.0156610",
      "lng": "-6.8345133"
    },
    "address": "471 Avenue Mohammed V Appartement N°8, 3ème étage, Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/163286898.jpg?k=e86fc02cd797c54ac7d5e2d5d089c53c83fcfc5045689a8e805d11b926a4ade5&o=&hp=1"
  },
  {
    "id": 57,
    "name": "Hotel Le Musée",
    "url": "https://www.booking.com/hotel/ma/le-musee.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at Hotel Le Musée! To save at this property, all you have to do is sign in.\nLocated in Rabat, 900 metres from Tennis Stadium, Hotel Le Musée offers air-conditioned rooms with free WiFi. The hotel provides a terrace and a shared lounge. Private parking is available on site.\n\nAt the hotel, every room has a desk. Rooms include a wardrobe and a flat-screen TV, and some rooms come with a terrace. At Hotel Le Musée, all rooms are fitted with a private bathroom with free toiletries.\n\nThe accommodation can conveniently provide information at the reception to help guests to get around the area.\n\nThe nearest airport is Rabat-Salé Airport, 8 km from the property.",
    "stars": 3,
    "price": null,
    "currency": "MAD",
    "rating": 8.3,
    "reviews": 489,
    "breakfast": null,
    "checkIn": "From 14:00 to 00:00",
    "checkOut": "From 11:30 to 12:00",
    "location": {
      "lat": "34.0157217",
      "lng": "-6.8323338"
    },
    "address": "Rue Benghazi, Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/432/432897618.jpg"
  },
  {
    "id": 58,
    "name": "ONOMO Hotel Rabat Terminus",
    "url": "https://www.booking.com/hotel/ma/cantor-hotels-rabat-terminus.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "You're eligible for a Genius discount at ONOMO Hotel Rabat Terminus! To save at this property, all you have to do is sign in.\nOffering a sun terrace and views of the city, ONOMO Hotel Rabat Terminus is located in Rabat, 300 metres from Moroccan Parliament. Guests can enjoy the on-site restaurant.\n\nFree WiFi is provided throughout the property and free private parking is available on site.\n\nA flat-screen TV with satellite channels is offered. There is a 24-hour front desk at the property.\n\nNational Office for Hydrocarbons and Mining is 300 metres from ONOMO Hotel Rabat Terminus, while Goethe-Institut is 300 metres away. The nearest airport is Rabat-Salé Airport, 8 km from ONOMO Hotel Rabat Terminus.",
    "stars": 4,
    "price": null,
    "currency": "MAD",
    "rating": 7.5,
    "reviews": 489,
    "breakfast": null,
    "checkIn": "From 14:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "34.0158098",
      "lng": "-6.8351081"
    },
    "address": "286, Avenue Mohamed V, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/440/440168184.jpg"
  },
  {
    "id": 59,
    "name": "HOTEL VELLEDA",
    "url": "https://www.booking.com/hotel/ma/velleda.en-gb.html?selected_currency=USD&changed_currency=1&lang=en-gb&group_adults=2&no_rooms=1&order=distance_from_search&nflt=price%3DUSD-0-999999-1",
    "type": "hotel",
    "description": "Located 2.1 km from Plage de Rabat, HOTEL VELLEDA offers 1-star accommodation in Rabat and features a terrace. The property is close to National Office for Hydrocarbons and Mining, Ministry of Agriculture and Marine Fisheries and Ministry of Economics and Finance. Plage de Salé Ville is 2.2 km away and Kasbah of the Udayas is 2.5 km from the hotel.\n\nGuest rooms in the hotel are equipped with a flat-screen TV and free toiletries.\n\nSpeaking Arabic, English and French at the 24-hour front desk, staff are ready to help around the clock.\n\nPopular points of interest near HOTEL VELLEDA include The National Library of the Kingdom of Morocco, Hassan Tower and Moroccan Parliament. The nearest airport is Rabat-Salé Airport, 10 km from the accommodation.",
    "stars": 1,
    "price": null,
    "currency": "MAD",
    "rating": 8,
    "reviews": 172,
    "breakfast": null,
    "checkIn": "From 08:00 to 00:00",
    "checkOut": "Until 12:00",
    "location": {
      "lat": "34.0181270",
      "lng": "-6.8342440"
    },
    "address": "106 Avenue Allal Ben Abdellah 4éme étage, (Ascenseur)., Hassan, 10000 Rabat, Morocco",
    "rooms": [],
    "region": "Rabat-Sale-Kenitra",
    "image": "https://cf.bstatic.com/images/hotel/max1024x768/267/267906018.jpg"
  }
]